import { LocalStorageService } from './local-storage.service';
import { Injectable } from '@angular/core';
import { Observable, of } from 'rxjs';
import { BaseCrudService } from './base-crud.service';
import { News } from '../types/news';
import { LocalStorageEnum } from '../types/enums/local-storage.enum';

@Injectable({
  providedIn: 'root',
})
export class DataService extends BaseCrudService<News> {
  private fakeData: News[] = [
    {
      id: 1,
      title:
        'សម្តេចមហាបវរធិបតី ហ៊ុន ម៉ាណែត អញ្ជើញចែកសញ្ញាបត្រ ជូននិស្សិតសាកលវិទ្យាល័យអាស៊ី-អឺរ៉ុប ចំនួន២,៥៥១នាក់រ',
      category: 'news',
      content: `នៅព្រឹកថ្ងៃពុធ ៧រោច ខែមាឃ ឆ្នាំរោង ឆស័ក ព.ស.២៥៦៨ ត្រូវនឹង​ថ្ងៃទី១៩ ខែកុម្ភៈ ឆ្នាំ២០២៥នេះ សម្តេចមហាបវរធិបតី ហ៊ុន ម៉ាណែត នាយករដ្ឋមន្ត្រីកម្ពុជា អញ្ជើញចែកសញ្ញាបត្រជូននិស្សិតសាកលវិទ្យាល័យអាស៊ី អឺរ៉ុប ចំនួន ២,៥៥១នាក់ នារី ១,១៦៩នាក់។ និស្សិតដែលទទួលសញ្ញាបត្រនេះ រួមមាន ថ្នាក់បរិញ្ញាបត្ររង ថ្នាក់បរិញ្ញាបត្រ ថ្នាក់បរិញ្ញាបត្រជាន់ខ្ពស់ ថ្នាក់បណ្ឌិត និងបណ្ឌិតកិត្តិយស។
        និស្សិតដែលទទួលសញ្ញាបត្រនេះ មាននិស្សិតអាហារូបករណ៍ របស់សម្តេចតេជោ និង​សម្តេចកិត្តិព្រឹទ្ធបណ្ឌិត មានចំនួន ៦៩នាក់ផងដែរ។
        សាកលវិទ្យាល័យអាស៊ី អឺរ៉ុប គឺជាគ្រឹះស្ថានអប់រំថ្នាក់ឧត្តមសិក្សាមួយ ដែលបានរួម​ចំណែកជាមួយរាជរដ្ឋាភិបាលក្នុងការបណ្តុះបណ្តាលធនធានមនុស្ស ដើម្បីចូលរួមចំណែកកសាងជាតិជាច្រើនឆ្នាំមកហើយ។
        អ្នកឧកញ៉ា លី ឃុនថៃ ប្រធានក្រុមប្រឹក្សាភិបាលសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប បានឱ្យដឹងថា សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប បានកើតចេញពីអង្គការ ក្នុងស្រុកមួយបណ្តុះបណ្តាល​ជំនាញវគ្គខ្លី ទទួលស្គាល់ជាផ្លូវការដោយក្រសួងអប់រំ យុវជន និងកីឡា ក្នុងឆ្នាំ២០០២។ អង្គការ អាស៊ី អឺរ៉ុប បានបង្កើតបន្ថែមជាសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប ក្នុងឆ្នាំ២០០៥។ នៅឆ្នាំ២០១២ សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប ជាសាកលវិទ្យាល័យឯកជន ដែលបានបង្កើតថ្នាក់បរិញ្ញាបត្រអក្សរសាស្ត្រចិនមុនគេបង្អស់ ទទួលការគាំទ្រពីក្រសួង អប់រំ យុវជន កីឡា និងស្ថានទូតចិនប្រចាំនៅកម្ពុជា។
        សព្វថ្ងៃនេះ ទាំងសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប និងអង្គការអាស៊ី អឺរ៉ុប បាននិងកំពុងបណ្ដុះបណ្ដាលធនធានមនុស្សយ៉ាងសកម្ម សរុបបានជាង២២ឆ្នាំ ដើម្បីបម្រើការអភិវឌ្ឍន៍សេដ្ឋកិច្ច​និងសង្គមកម្ពុជា ស្របតាមគោលនយោបាយរាជរដ្ឋាភិបាល។
        អ្នកឧកញ៉ា លី ឃុនថៃ បានឱ្យដឹងថា គិតត្រឹមខែធ្នូ ឆ្នាំ២០២៤ អង្គការ និងសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប មានក្រុមប្រឹក្សាភិបាល គណៈគ្រប់គ្រង និយោជិត និងសាស្រ្តាចារ្យសរុបចំនួន៤៨៥នាក់ ព្រមទាំងសិស្សថ្នាក់វិជ្ជាជីវៈ និងនិស្សិតកំពុងសិក្សាសរុបចំនួន ៨, ៨៨១នាក់។ ក្នុងនោះ ចាប់ពីឆ្នាំសិក្សា២០០៥ ដល់ត្រឹមឆ្នាំសិក្សា ២០២២ សិស្សថ្នាក់វិជ្ជា​ជីវៈ និងនិស្សិតគ្រប់កម្រិត បានបញ្ចប់ការសិក្សាសរុបចំនួន ៦៤,៤២៣នាក់ (នារី ២៧ ០៤៥នាក់) រាប់បញ្ចូលទាំងនិស្សិតជ័យលាភីដែលកំពុងមានវត្តមាននៅទីនេះ។
        បច្ចុប្បន្នសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប មានមហាវិទ្យាល័យវិទ្យាសាស្រ្ត និងបច្ចេកវិទ្យា, មហាវិទ្យាល័យសង្គមសាស្រ្ត និងសេដ្ឋកិច្ច, មហាវិទ្យាល័យនីតិសាស្រ្ត និងវិទ្យាសាស្រ្ត​នយោបាយ, មហាវិទ្យាល័យគ្រប់គ្រងពាណិជ្ជកម្ម និងទេសចរណ៍, និង មហាវិទ្យាល័យ សិល្បៈ មនុស្សសាស្ត្រ និងភាសាបរទេស ក្នុងនោះ ថ្នាក់បរិញ្ញាបត្ររង ថ្នាក់ឆ្នាំសិក្សាមូលដ្ឋាន និងថ្នាក់បរិញ្ញាបត្រ មានមុខជំនាញចំនួន២៣, ចំណែកថ្នាក់បរិញ្ញាបត្រជាន់ខ្ពស់ មានមុខជំនាញចំនួន១៨ និងថ្នាក់បណ្ឌិត មានមុខជំនាញចំនួន៩។
        អ្នកឧកញ៉ា លី ឃុនថៃ ក៏បានឱ្យដឹងផងដែរថា សាកលវិទ្យាល័យអាស៊ី អឺរ៉ុប បានអនុវត្ត​របៀបគ្រប់គ្រង និងផ្តល់សេវាកម្មអប់រំ តាមបែប​ឌីជីថល និងបន្តពិនិត្យរៀបចំដាក់បញ្ចូលឱ្យប្រើប្រាស់ជាបន្តបន្ទាប់នូវប្រព័ន្ធឌីជីថលជាច្រើនទៀត ដូចជា A.I, Machine Learning, Cloud Computing, ប្រព័ន្ធគ្រប់គ្រងវត្តមានតាមផ្ទៃមុខ និងប្រព័ន្ធគ្រប់​គ្រងអគារឆ្លាតវៃជាដើម។
        សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប ក៏បានបង្កើតឱ្យមានបន្ទប់អនុវត្តន៍ជាច្រើនប្រភេទ រួមមាន​សវនាការនិមិត្ត, បន្ទប់ AI, បន្ទប់អនុវត្តន៍ផ្នែកសណ្ឋាគារ, បន្ទប់អនុវត្តន៍ផ្នែកម្ហូបអាហារ និង​ភេសជ្ជៈ និងបន្ទប់អនុវត្តន៍ធនាគារ ដែលផ្ដល់ឱកាសដល់និស្សិតអាចសិក្សា​ទ្រឹស្ដី​ផ្សារភ្ជាប់នឹងការអនុវត្តជាក់ស្ដែង។
        បន្ថែមលើការអភិវឌ្ឍផ្នែកបណ្ដុះបណ្ដាលតាមបែប​ឌីជី​ថល និងជម្រើសនៃការសិក្សា​ដ៏​សម្បូរ​បែប សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប ក៏បានពង្រីក​ខ្លួនបន្ថែមនូវទីតាំងទី៣ នៅអគារ​ឌឹហ្គេតវេយ៍ (The Gateway) បានចាប់កំណើត​ឡើង​ដោយបើកការដ្ឋាននៅឆ្នាំ២០១៦ ក្រោមអធិបតីភាពសម្តេចមហាបវរ​ធិបតី ហើយបច្ចុប្បន្ន The Gateway ជាអគារធំ​មួយ មានចំណតធំទូលាយប្រមាណ ៧០០គ្រឿង បំពាក់ដោយបរិក្ខារទំនើបៗ ដែលបាន​ផ្ដល់បរិយាកាសសិក្សាល្អប្រសើរដល់និស្សិតថ្នាក់បរិញ្ញាបត្រជាន់ខ្ពស់ និងថ្នាក់បណ្ឌិត។
        សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប ក៏បានបង្កើតថ្នាក់បរិញ្ញាបត្រជាន់ខ្ពស់ជំនាញប្រតិបត្តិផ្នែក​គ្រប់គ្រងពាណិជ្ជកម្ម EMBA ផងដែរ។ មិនតែប៉ុណ្ណោះ ដើម្បីឆ្លើយតបនឹងតម្រូវការជាក់​ស្តែងរបស់សង្គមជាតិ សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប បានរៀបចំផែនការសកម្មភាព​សម្រាប់​ការផ្លាស់ប្តូរការអប់រំបែបឌីជីថល ហើយបានលើកអាទិភាពសំខាន់ៗបី៖
        អាទិភាពទី១៖ ជំរុញការប្រើប្រាស់បច្ចេកវិទ្យាឌីជីថលសម្រាប់ការបង្រៀន និងការសិក្សា។
        អាទិភាពទី២៖ អភិវឌ្ឍជំនាញ និងសមត្ថភាពឌីជីថល
        អាទិភាពទី៣៖ កែលម្អប្រព័ន្ធអប់រំក្នុងសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប តាមរយៈការធ្វើឱ្យ​ប្រសើរឡើងនូវការតាមដាន ការវាយតម្លៃ ការវិភាគ និងការគ្រប់គ្រងទិន្នន័យ។ល។
        អ្នកឧកញ៉ា លី ឃុនថៃ បានឱ្យដឹងទៀតថា ក្នុងគោលដៅនៃការអភិវឌ្ឍធនធានមនុស្ស ក៏ដូចជាចក្ខុវិស័យដ៏វែងឆ្ងាយ សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប បានពង្រឹងយន្តការលើការងារ​ដឹកនាំការងារគ្រប់គ្រង និងអនុវត្ត ស្របតាមផែនការជាសារវន្តរបស់ក្រសួងអប់រំ យុវជន និងកីឡា។ ស្របពេលជាមួយគ្នានេះ សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប មានថ្នាល​ពាណិជ្ជ​កម្មយ៉ាងធំទូលាយសម្រាប់ជួយរកការងារដល់សិស្សនិស្សិត​កំពុងសិក្សា និងបាន​បញ្ចប់ការសិក្សា ព្រមទាំងបានប្រើប្រាស់បញ្ជរសេវាសាធារណៈចល័តរបស់​ក្រសួងការ​ងារ និងបណ្ដុះបណ្ដាលវិជ្ជាជីវៈ តាំងនៅទីតាំងសាកលវិទ្យាល័យផ្ទាល់ ដើម្បីផ្ដល់ភាព​ងាយស្រួលឆាប់រហ័សក្នុងការចែករំលែកព័ត៌មានពីឱកាសការងារ និងព័ត៌មានជាច្រើន​ផ្សេងទៀត។
        សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប ក៏បាននិងកំពុងពង្រីកកិច្ចសហប្រតិបត្តិការជាមួយក្រសួង ស្ថាប័ន សាកលវិទ្យាល័យនៅបណ្ដាប្រទេសជាច្រើនលើពិភពលោក តាមរយៈការចុះអនុ​ស្សារណៈនៃការយោគយល់គ្នា ការផ្លាស់ប្ដូរនិស្សិតទៅវិញទៅមក ការរៀបចំកម្មវិធី បាថក​ថា សិក្ខាសាលា វេទិកានានា ជាប្រចាំ ដោយអញ្ជើញវាគ្មិនល្បីៗមកចូលរួមក្នុងគោល​បំណង​ជួយដល់និស្សិត ដើម្បីទទួលបានចំណេះដឹង បទពិសោធន៍ថ្មីៗ និងឱកាសធ្វើកម្ម​សិក្សាជាក់ស្តែង ដែលជាទុនដ៏សំខាន់សម្រាប់ការសិក្សា និងការបំពេញការងារ។
        ពិសេសជាងនេះទៀត សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប ក៏បានបង្កើតឱកាស និងលើកទឹក​ចិត្ត​ដល់ក្មួយៗនិស្សិតបានចូលរួមក្នុងសកម្មភាពសង្គម និងសកម្មភាពមនុស្សធម៌ជាច្រើន តាមរយៈក្លឹបយុវជន ប្រចាំសាកលវិទ្យាល័យ រួមមាន៖ សកម្មភាពសប្បុរសធម៌កាកបាទក្រហម កម្មវិធីសហព័ន្ធ សហភាពយុវជនកម្ពុជា (ហៅកាត់ សសយក) កម្មវិធីអង្គរ​សង្ក្រាន្ត វគ្គបណ្ដុះបណ្ដាលអំពីវិជ្ជាសង្រ្គោះបឋម យុទ្ធនាការបរិច្ចាគឈាម យុទ្ធនាការ​រើសសម្រាមសម្អាតបរិស្ថាន យុទ្ធនាការដាំកូនឈើ យុទ្ធនាការផ្សព្វផ្សាយអំពីច្បាប់ចរាចរណ៍ផ្លូវគោក និងសកម្មភាពនានា ជាច្រើនផ្សេងទៀត។ល៕`,
      date: '១៩ កុម្ភៈ ២០២៥',
      save: true,
      thumbnail:
        'https://aeu.edu.kh/pages/480427506_981694907478522_7518524700755195923_n_1740717570.jpg',
      images: [
        'https://aeu.edu.kh/pages/480678738_571979199206774_8356312523110674209_n_1740717589.jpg',
        'https://aeu.edu.kh/pages/480645250_981695460811800_863911038670606904_n_1740717617.jpg',
        'https://aeu.edu.kh/pages/1_1740717634.jpg',
        'https://aeu.edu.kh/pages/480683755_571979689206725_8397643982556626633_n_1740717656.jpg',
        'https://aeu.edu.kh/pages/480545529_571979842540043_1074104513799003259_n_1740717686.jpg',
      ],
    },
    {
      id: 2,
      title: `សិក្ខាសាលាផ្សព្វផ្សាយស្តីពី " ច្បាប់ស្តីពីគណនេយ្យនិងសវនកម្ម និងបទប្បញ្ញត្តិពាក់ព័ន្ធ " ជូនដល់សាស្រ្ដាចារ្យ និងនិស្សិត ជំនាញគណនេយ្យ និងធនាគារនិងហិរញ្ញវត្ថុ  នៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប`,
      category: 'event',
      content: `នាព្រឹកថ្ងៃព្រហស្បតិ៍ ១កើត ខែផល្គុន ឆ្នាំរោង ឆស័ក ព.ស.៥៦៨ ត្រូវនឹងថ្ងៃទី២៧ ខែកុម្ភៈ ឆ្នាំ២០២៥ សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប សហការជាមួយ និយ័តករគណនេយ្យនិងសវនកម្ម នៃអាជ្ញាធរសេវាហិរញ្ញវត្ថុមិនមែនធនាគារ បានរៀបចំសិក្ខាសាលាផ្សព្វផ្សាយ ច្បាប់ស្តីពីគណនេយ្យនិងសវនកម្ម និងបទប្បញ្ញត្តិពាក់ព័ន្ធ ជូនសាស្ត្រាចារ្យ និងនិស្សិត នៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប ក្រោមអធិបតីភាពដ៏ខ្ពង់ខ្ពស់ ឯកឧត្តម ប៊ូ ថារិន អគ្គនាយក នៃនិយ័តករគណនេយ្យនិងសវនកម្ម អមដោយថ្នាក់ដឹកនាំ និងមន្ត្រីនៃយ័តករគណនេយ្យនិងសវនកម្ម។ សិក្ខាសាលានេះមានការ អញ្ជើញចូលរួមពី ឯកឧត្តមសាស្ត្រាចារ្យបណ្ឌិត សួស សោភា សាកលវិទ្យាធិការរង នៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប តំណាងដ៏ខ្ពង់ខ្ពស់ អ្នកឧកញ៉ា លី ឃុនថៃ ប្រធានក្រុមប្រឹក្សាភិបាល នៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុបព្រមទាំងលោកស្រី សាវុធ ដាលី នាយកប្រតិបត្តិ នៃវិទ្យាស្ថានគណនេយ្យករជំនាញនិងសវនករកម្ពុជា ថ្នាក់ដឹកនាំ មន្ត្រី នៃនិយ័តករគណនេយ្យនិងសវនកម្ម លោកគ្រូ អ្នកគ្រូ និងសិស្ស និស្សិត ចំនួន២០០នាក់។ សិក្ខាសាលានេះត្រូវបានរៀបចំឡើងក្នុងគោលបំណងផ្សព្វផ្សាយ និងបញ្ជាបការការយល់ដឹងអំពីច្បាប់និងបទប្បញ្ញត្តិពាក់ព័ន្ធនឹងច្បាប់គណនេយ្យនិងសវនកម្ម ស្តង់ដាបច្ចេកទេសនៅកម្ពុជា ជូនដល់សាស្ត្រាចារ្យ និងនិស្សិតដែលកំពុងសិក្សាជំនាញពាក់ព័ន្ធ។ 
        ជាកិច្ចចាប់ផ្តើម ឯកឧត្តមសាស្ត្រាចារ្យបណ្ឌិត សាកលវិទ្យាធិការរង មានមតិស្វាគមន៍យ៉ាងកក់ក្តៅ ព្រមទាំងថ្លែង អំណរគុណចំពោះ ឯកឧត្តមអគ្គនាយក ថ្នាក់ដឹកនាំ មន្ត្រី នៃនិយ័តករគណនេយ្យនិងសវនកម្ម ដែលបានរៀបចំ សិក្ខាសាលាដ៏មានសារៈសំខាន់នេះជូនដល់ លោកគ្រូ អ្នកគ្រូ សិស្សនិងនិស្សិត នៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប និងលើកទឹកចិត្តដល់និស្សិត ទាំងអស់ដែលបានចូលរួមក្នុងអង្គសិក្ខាសាលាឱ្យយកចិត្តទុកដាក់ស្ដាប់វាគ្មិនធ្វើបទបង្ហាញ ដើម្បីទទួលបាននូវពុទ្ធិបន្ថែមពាក់ព័ន្ធវិស័យគណនេយ្យនឹងសវនកម្ម ដែលអាចយកទៅប្រើប្រាស់បាន។ ឯកឧត្តមសាស្ត្រាចារ្យបណ្ឌិត បានបន្ថែមទៀតថាសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប ជាសាកលវិទ្យាល័យឯកជនមួយ ដែលបានចាប់កំណើតឡើងពីអង្គការក្រៅរដ្ឋាភិបាលក្នុងស្រុក នៅថ្ងៃទី៩ ខែកញ្ញា  ឆ្នាំ២០០២ មានឈ្មោះថា អង្គការវិទ្យាស្ថាន អាស៊ី អឺរ៉ុប។ ការកិច្ចខិតខំប្រឹងប្រែងអភិវឌ្ឍន៍ជាបន្តបន្ទាប់ក៏ប្រែក្លាយខ្លួនទៅជា សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប នៅថ្ងៃទី១៩ ខែមករា ឆ្នាំ២០០៥។ ដោយមានការពិនិត្យ និងវាយតម្លៃយ៉ាងហ្មត់ចត់ទៅលើគុណវុឌ្ឍិ៍តាមកម្រិតស្តង់ដាគុណភាពអប់រំនោះ សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប ត្រូវបានគណៈកម្មាធិការទទួលស្គាល់គុណភាពអប់រំនៃកម្ពុជា ផ្តល់ការទទួលស្គាល់គុណភាពអប់រំនៃកម្ពុជាកម្រិតគ្រឹះស្ថានទាំងមូលរយៈពេល ៥ឆ្នាំ ជាបន្តទៀត (២០២៣-២០២៧)។  
        ជាកិច្ចបន្ទាប់ ឯកឧត្តម ប៊ូ ថារិន អគ្គនាយក នៃនិយ័តករគណនេយ្យនិងសវនកម្ម បានថ្លែងសុន្ទរកថា បើកអង្គសិក្ខាសាលា ដោយបានលើកអំពីការវិវឌ្ឍន៍របស់ស្ថាប័នតាំងពីឆ្នាំ២០០២ ក្រោយពីច្បាប់ស្តីពីគណនេយ្យសហគ្រាស សវនកម្មគណនេយ្យសហគ្រាស និងវិជ្ជាជីវៈគណនេយ្យបានចូលជាធរមានមកមានស្ថាប័ន២ ត្រូវបានបង្កើតឡើងដាក់ឱ្យអនុវត្តគឺ ក្រុមប្រឹក្សាជាតិគណនេយ្យ និងវិទ្យាស្ថានគណនេយ្យករជំនាញនិងសវនករកម្ពុជា។ បន្ទាប់មកនៅឆ្នាំ២០១៦ ក៏បានផ្លាស់ប្តូរទៅជាច្បាប់ស្តីពីគណនេយ្យនិងសវនកម្មវិញ។ ជាក់ស្តែងកាលពីឆ្នាំ២០២១ មានការកែប្រែនូវរចនាសម្ព័ន្ធ ស្ថាប័នដែលធ្វើឱ្យក្រុមប្រឹក្សាជាតិគណនេយ្យបានក្លាយជានិយ័តករគណនេយ្យនិងសវនកម្ម ស្របតាមច្បាប់ស្តីពីការរៀបចំ និងការប្រព្រឹត្តិទៅនៃអាជ្ញាធរសេវាហិរញ្ញវត្ថុមិនមែនធនាគារ។ បច្ចុប្បន្ន និយ័តករគណនេយ្យនិងសវនកម្ម ត្រូវបន្តអនុវត្ត មុខងារភារកិច្ចពីក្រុមប្រឹក្សាជាតិគណនេយ្យ និងត្រូវស្ថិតក្រោមអាណាព្យាបាលរបស់អាជ្ញាធរសេវាហិរញ្ញវត្ថុមិនមែនធនាគារ។
        ក្នុងនោះផងដែរ ឯកឧត្តមអគ្គនាយក បានគូសបញ្ជាក់ថា ក្នុងឆ្នាំ២០២៥ និងឆ្នាំខាងមុខ និយ័តករគណនេយ្យ និងសវនកម្ម នឹងបន្តរៀបចំការផ្សព្វផ្សាយបន្ថែមទៀតនូវច្បាប់ស្តីពីគណនេយ្យនិងសវនកម្ម និងកាតព្វកិច្ចគណនេយ្យនិង សវនកម្មស្របតាមផែនការ និងការណែនាំដ៏ខ្ពង់ខ្ពស់របស់ ឯកឧត្តមអគ្គបណ្ឌិតសភាចារ្យ អូន ព័ន្ធមុនីរ័ត្ន ឧបនាយករដ្ឋមន្ត្រី រដ្ឋមន្ត្រីក្រសួងសេដ្ឋកិច្ចនិងហិរញ្ញវត្ថុនិងជាប្រធានក្រុមប្រឹក្សាអាជ្ញាធរសេវា ហិរញ្ញវត្ថុមិនមែនធនាគារ ក្នុងគោលបំណងបញ្ញាបការយល់ដឹងឱ្យកាន់តែទូលំទូលាយ និងច្បាស់លាស់អំពីច្បាប់ និងបច្ចុប្បន្នភាពនៃបទប្បញ្ញត្តិពាក់ព័ន្ធនឹងវិស័យនិងវិជ្ជាជីវៈគណនេយ្យនិងសវនកម្ម។ ឯកឧត្តមអគ្គនាយក បានបន្ថែមថា ការជំរុញការអនុវត្តកាតព្វកិច្ចទាំងនេះពីសំណាក់និយ័តករគណនេយ្យនិងសវនកម្ម នឹងផ្តល់ប្រយោជន៍យ៉ាង ពិតប្រាកដ ដល់និស្សិតដែលសិក្សាជំនាញគណនេយ្យនោះគឺភាពមានការងារធ្វើ។ ជំនាញគណនេយ្យ គឺជាជំនាញមួយដ៍សំខាន់ដែលគ្រប់ស្ថាប័ន ទាំងស្ថាប័នរដ្ឋ និងស្ថាប័បឯកជន ត្រូវការជំនាញនេះមិនអាចខ្វះបាន។ បច្ចុប្បន្ន ផ្តើមចេញពីការដាក់ចេញនូវវិធានការតឹងរឹងក្នុងការពង្រឹងអនុលោមភាព សេចក្តីត្រូវការគណនេយ្យករដែលមានគុណវុឌ្ឍខ្ពស់ គណនេយ្យករ ជំនាញនិងសវនករ មានការកើនឡើងយ៉ាងគំហុគដែលយើងអាចវាយតម្លៃបានថា នាថ្ងៃអនាគតដ៏ខ្លីខាងមុខតុល្យភាពនៃការផ្គត់ផ្គង់និងតម្រូវការទីផ្សារនៃសេវាគណនេយ្យនិងសវនកម្ម ដែលតម្រូវឱ្យនិយ័តករគណនេយ្យនិងសវនកម្ម និងវិទ្យាស្ថានគណនេយ្យករជំនាញនិងសវនករកម្ពុជា និងរាជរដ្ឋាភិបាលយកចិត្តទុកដាក់ជាអាទិភាពលើការកសាងធនធានមនុស្ស។ មិនត្រឹមតែប៉ុណ្ណោះ ឯកឧត្តមអគ្គនាយក បានលើកយកនូវចំណុចសំខាន់នៃការរៀបចំរបាយការណ៍ ហិរញ្ញវត្ថុស្របតាមស្តង់ដាជាធរមាន នឹងជួយលើកកម្ពស់តម្លាភាពនិងភាពអាចទុកចិត្តបាននៃរបាយការណ៍ហិរញ្ញវត្ថុផង និងជួយសម្រួលដល់សហគ្រាស និងអង្គភាពមិនស្វែងរកប្រាក់ចំណេញ ក្នុងការបំពេញកាតព្វកិច្ចសារពើពន្ធផង ហើយ ការនេះវាជាបច្ច័យមួយរួមចំណែកជួយដល់កំណើនចំណូលសារពើពន្ធ។ 
        ជាចុងបញ្ចប់ ឯកឧត្តមអគ្គនាយក បានថ្លែងអំណរគុណដល់ ឯកឧត្តមសាស្ត្រាចារ្យបណ្ឌិត សួស សោភា សាកលវិទ្យាធិការរង នៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប តំណាងដ៏ខ្ពង់ខ្ពស់ អ្នកឧកញ៉ា លី ឃុនថៃ ប្រធានក្រុមប្រឹក្សាភិបាល នៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប និងក្រុមការងាររបស់និយ័តករគណនេយ្យនិងសវនកម្ម ដែលបានសហការរៀបចំសិក្ខាសាលា ដ៏មានសារៈសំខាន់នេះឡើង និងបានជូនពរដល់ក្រុមការងារព្រមទាំងនិស្សិតទាំងអស់សូមទទួលបាននូវសុខភាពល្អ កម្លាំងពលំមាំមួន និងសម្រេចបានជោគជ័យគ្រប់ភារកិច្ច។`,
      date: '២៧ កុម្ភៈ ២០២៥',
      save: false,
      thumbnail:
        'https://aeu.edu.kh/pages/photo_2025-02-28_11-24-47_1740716720.jpg',
      images: [
        'https://aeu.edu.kh/pages/photo_2025-02-28_11-24-50_1740716737.jpg',
        'https://aeu.edu.kh/pages/photo_2025-02-28_11-24-54_1740716751.jpg',
        'https://aeu.edu.kh/pages/photo_2025-02-28_11-24-57_1740716766.jpg',
        'https://aeu.edu.kh/pages/photo_2025-02-28_11-25-00_1740716779.jpg',
      ],
    },
    {
      id: 3,
      title: `សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប សហការជាមួយអាជ្ញាធរជាតិដោះស្រាយវិវាទក្រៅប្រព័ន្ធតុលាការរៀបចំបាឋកថាផ្សព្វផ្សាយអំពីបេសកកម្មរបស់អាជ្ញាធរជាតិដោះស្រាយវិវាទក្រៅប្រព័ន្ធតុលាការ ជូនគណៈគ្រប់គ្រង បុគ្គលិក សាស្រ្តាចារ្យ និងនិស្សិតប្រមាណ ២៥០ អង្គ/នាក់។`,
      category: 'news',
      content: `ភ្នំពេញ៖ នាព្រឹកថ្ងៃពុធ ១៤រោច ខែមាឃ ឆ្នាំរោង ឆស័ក ព.ស.២៥៦៨ ត្រូវនឹងថ្ងៃទី២៦ ខែកុម្ភៈ ឆ្នាំ២០២៥សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុបបានសហការជាមួយអាជ្ញាធរជាតិដោះស្រាយវិវាទក្រៅប្រព័ន្ធតុលាការ (អ.ដ.ក.) បានរៀបចំបាឋកថាផ្សព្វផ្សាយអំពីបេសកកម្មដោះស្រាយវិវាទក្រៅប្រព័ន្ធតុលាការជូនដល់ គណៈគ្រប់គ្រង បុគ្គលិក សាស្រ្តាចារ្យ និងនិស្សិតទាំងអស់នៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប ក្រោមសហអធិបតីភាព លោកសាស្រ្តាចារ្យបណ្ឌិត សួស សោភា សាកលវិទ្យាធិការរង តំណាងលោក ស៊ុន សេដ្ឋា សាកលវិទ្យាធិការ នៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប និងឯកឧត្តម សុខ បូរ៉ា និងឯកឧត្តម លាវ ពិសិដ្ឋ អគ្គលេខាធិការរងនៃអាជ្ញាធរជាតិដោះស្រាយវិវាទក្រៅប្រព័ន្ធតុលាការព្រមទាំងលោក យន់ សុវណ្ណារ៉ា ប្រធាននាយកដ្ឋានស្រាវជ្រាវ បច្ចេកទេស និងកិច្ចការច្បាប់ នៃអគ្គលេខាធិការដ្ឋានអាជ្ញាធរជាតិដោះស្រាយវិវាទក្រៅប្រព័ន្ធតុលាការដែលជាវាគ្មិនកិត្តិយស។
        បាឋកថាផ្សព្វផ្សាយនេះ មានការអញ្ជើញចូលរួមពីសំណាក់ គណៈគ្រប់គ្រង បុគ្គលិក សាស្រ្តាចារ្យ មន្រ្តីនៃអាជ្ញាធរជាតិដោះស្រាយវិវាទក្រៅប្រព័ន្ធតុលាការ និងនិស្សិតសរុបប្រមាណ ២៥០រូប។
        ឆ្លៀតក្នុងឱកាសនេះ លោកសាស្រ្តាចារ្យបណ្ឌិតសាកវិទ្យាធិការរង បានឱ្យដឹងដែរថា ដើម្បីជួយពង្រឹងសមត្ថភាព និងលើកកម្ពស់ចំណេះដឹងថ្មីៗ សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប បានរៀបចំនូវកម្មវិធីបាឋកថា សិក្ខាសាលា និងវេទិការវិទ្យាសាស្ត្រជាច្រើនដង និងជាប្រចាំឆ្នាំទៅតាមកម្មវិធីដែលបានគ្រោងទុក តាមរយៈជំនាញផ្សេងៗគ្នានៃមហាវិទ្យាល័យ នីមួយៗ និងសាលាក្រោយឧត្តម ដោយបានអញ្ជើញបណ្ឌិតសភាចារ្យ សាស្ត្រាចារ្យ អ្នកឯកទេស វាគ្មិនល្បីៗ ដែលមានជំនាញជ្រៅជ្រះទាំងក្នុងវិស័យសាធារណៈ និងឯកជន។
        ថ្លែងក្នុងឱកាសនេះ ឯកឧត្តម សុខ បូរ៉ា អគ្គលេខាធិការរង នៃ អ.ដ.ក បានលើកឡើងអំពីគោលនយោបាយរបស់រាជរដ្ឋាភិបាលនីតិកាលទី៧ នៃរដ្ឋសភានេះដែលបានចាត់ទុកការកែទម្រង់ប្រព័ន្ធយុត្តិធម៌ ជាជ្រុងមួយនៃស្នូលនៃយុទ្ធសាស្ត្របញ្ចកោណដំណាក់កាលទី១។
        ការកែទម្រង់ប្រព័ន្ធយុត្តិធម៌នេះនឹងត្រូវធ្វើលើសសរស្ដម្ភចំនួន២ គឺសសរស្ដម្ភទី១ ការកែទម្រង់ប្រព័ន្ធតុលាការ និងសសរស្ដម្ភទី២ ការកែទម្រង់ការដោះស្រាយវិវាទក្រៅប្រព័ន្ធតុលាការ។ ជាក់ស្តែង ការបង្កើតអាជ្ញាធរជាតិដោះស្រាយវិវាទក្រៅប្រព័ន្ធតុលាការ ដែលហៅកាត់ថា អ.ដ.ក. នេះ គឺជាសមិទ្ធផលថ្មីមួយ ដើម្បីដើរតួនាទីជាប្រតិបត្តិករក្នុងការកែទម្រង់ប្រព័ន្ធយុត្តិធម៌ លើសសរស្ដម្ភទី២ ការកែទម្រង់ការដោះស្រាយវិវាទក្រៅប្រព័ន្ធតុលាការ។
        អ.ដ.ក. គឺជាយន្តការថ្នាក់ជាតិមួយ បន្ថែមលើយន្តការដែលមានស្រាប់ ដែលមានបេសកកម្មដោះស្រាយវិវាទក្រៅប្រព័ន្ធតុលាការ សំដៅលើកកម្ពស់គុណភាព ប្រសិទ្ធភាព និងនិរន្តភាពនៃការដោះស្រាយវិវាទក្រៅប្រព័ន្ធតុលាការ ក្នុងគោលបំណងបង្ខិតសេវាដោះស្រាយវិវាទឱ្យកាន់តែខិតជិតប្រជាពលរដ្ឋនៅមូលដ្ឋាន ដែលអាចធានាបាននូវបរិយាកាសសន្តិភាពនិយម និងភាពសុខដុមរមនាក្នុងសង្គមជាតិ និងជួយកាត់បន្ថយការកកស្ទះសំណុំរឿងនៅតាមតុលាការ។
        ទន្ទឹមនេះ ឯកឧត្តមអគ្គលេខាធិការរង ក៏បានផ្តាំផ្ញើដល់ គណៈគ្រប់គ្រង បុគ្គលិក សាស្រ្តាចារ្យ និងនិស្សិតទាំងអស់នៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប ឱ្យជួយធ្វើការផ្សព្វផ្សាយបន្តឱ្យបានកាន់តែទូលំទូលាយ សំដៅធ្វើយ៉ាងណាឱ្យសាធារណជន ពិសេសប្រជាពលរដ្ឋដែលមានតម្រូវការប្រើប្រាស់សេវាដោះស្រាយវិវាទក្រៅប្រព័ន្ធតុលាការនេះ បានទទួលព័ត៌មានច្បាស់លាស់ អំពីការសម្រុះសម្រួលដោះស្រាយវិវាទក្រៅប្រព័ន្ធតុលាការដែលធ្វើឡើងក្នុងក្របខ័ណ្ឌនៃអ.ដ.ក. នេះផងដែរ។`,
      date: '២៦ កុម្ភៈ ២០២៥',
      save: false,
      thumbnail:
        'https://aeu.edu.kh/pages/photo_2025-02-28_11-16-21_1740716343.jpg',
      images: [
        'https://aeu.edu.kh/pages/photo_2025-02-28_11-16-24_1740716363.jpg',
        'https://aeu.edu.kh/pages/photo_2025-02-28_11-16-32_1740716381.jpg',
        'https://aeu.edu.kh/pages/photo_2025-02-28_11-16-35_1740716395.jpg',
      ],
    },
    {
      id: 4,
      title: `អ្នកវិជ្ជាជីវៈច្បាប់ទាំង ៥ រួមមាន ចៅក្រម មេធាវី ក្រឡាបញ្ជី អាជ្ញាសាលា និងសារការី បានធ្វើបាឋកថាស្តីពី «ការចែករំលែកបទពិសោធ និងត្រៀមខ្លួនប្រឡងប្រជែងវិជ្ជាជីវៈច្បាប់» ជូនដល់និស្សិតសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប ចំនួន២៩៥ អង្គ/នាក់`,
      category: 'news',
      content: `(ភ្នំពេញ)៖ លោកស្រី នាង ស៊ីណៃ ចៅក្រម នៃសាលាដំបូងខេត្តកំពង់ស្ពឺ លោក និន ភុស្ដភា មេធាវី នៃក្រុមហ៊ុន មេធាវីតម្រាច្បាប់ លោក ជុំ គីរី ក្រឡាបញ្ជី នៃសាលាដំបូងខេត្តព្រៃវែង លោកស្រី សាន សុជាតា អតីតសិស្សសារការី ជំនាន់ទី២ និងលោក ឡោ សហឺ  អាជ្ញាសាលានៃសាលាដំបូងរាជធានីភ្នំពេញ នាព្រឹកថ្ងៃទី៨ ខែកុម្ភៈ ឆ្នាំ២០២៥នេះ បានអញ្ជើញធ្វើបាឋកថាស្តីពី « ការចែករំលែកបទពិសោធ និងតៀមខ្លួនប្រឡងវិជ្ជាៈជីវៈច្បាប់» ដើម្បីជួយពង្រឹងសមត្ថភាព និងលើកកម្ពស់ចំណេះដឹងថ្មីៗ ជូនដល់បុគ្គលិក សាស្ត្រាចារ្យ និស្សិតសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប ចំនួន ២៩៥ អង្គ/នាក់ នៅសាលសន្និសីទ ជាន់ទី១៣ អគារមាស នៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប។
        ពិធីនេះមានការចូលរួមជាសហគណៈអធិបតីគឺ លោក ស៊ុន សេដ្ឋា សាកលវិទ្យាធិការនៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប និងលោក ជឹម សុធន ប្រធានក្រុមមគ្គទេសក៍ច្បាប់ គណៈគ្រប់គ្រង បុគ្គលិក សាស្រ្តាចារ្យ សមាជិកក្រុមមគ្គទេសក៍ច្បាប់ និងនិស្សិតជាច្រើននាក់ផងដែរ។
        ឆ្លៀតក្នុងឱកាសនេះ លោកសាកវិទ្យាធិការ បានឱ្យដឹងដែរថា ដើម្បីជួយពង្រឹងសមត្ថភាព និងលើកកម្ពស់ចំណេះដឹងថ្មីៗ សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប បានរៀបចំនូវកម្មវិធីបាឋកថា សិក្ខាសាលា និងវេទិការ     វិទ្យាសាស្ត្រ ជាច្រើនដង និងជាប្រចាំឆ្នាំទៅតាមកម្មវិធីដែលបានគ្រោងទុក ក្នុងរង្វង់ប្រមាណពី១០-១៥ដង តាមរយៈជំនាញផ្សេងៗគ្នានៃមហាវិទ្យាល័យនីមួយៗ និងសាលាក្រោយឧត្តម ដោយបានអញ្ជើញបណ្ឌិតសភាចារ្យ សាស្ត្រាចារ្យ អ្នកឯកទេស វាគ្មិនល្បីៗកម្រិតគរុសភា(Academic) ដែលមានជំនាញជ្រៅជ្រះទាំងក្នុងវិស័យសាធារណៈ និងឯកជន។
        លោកសាកលវិទ្យាធិកា បានបន្ថែមថា ជាសក្ខីភាពស្រាប់ សាកលវិទ្យាល័យបានប្រារព្ធនូវកម្មវិធីបាឋកថា ដែលបានទទួលវាគ្មិនជំនាញវិជ្ជាជីវៈរហូតទៅដល់ប្រាំរូប មកធ្វើបទបង្ហាញ ដើម្បីផ្តល់នូវចំណេះដឹង ពិសោធជាក់ស្តែងអំពីការត្រៀមខ្លួនដើម្បីប្រឡងប្រជែងវិជ្ជាជីវៈច្បាប់ ដែលប្រធានបទនេះ គឺពិតជាមានសារៈសំខាន់ខ្លាំងណាស់សម្រាប់និស្សិត សាស្ត្រាចារ្យ និងបុគ្គលិក ជាពិសេសសម្រាប់អ្នកសិក្សា ជំនាញ នីតិសាស្រ្ត នេះតែម្តង។ 
        លោក ជឹម សុធន បានបង្ហាញអំពី គោលបំណងចំនួន៥ ដែលនាំឱ្យមានការសហការបង្កើតនូវកម្មវិធីនេះឡើង  គោលបំណងទី១ ចង់ឱ្យនិស្សិតស្វែងយល់អំពីសញ្ញាណទូទៅនៃវិជ្ជាជីវៈច្បាប់ ថាតើអ្វីទៅជា ចៅក្រមព្រះរាជអាជ្ញា ក្រឡាបញ្ជី អាជ្ញាសាលា សារការី មេធាវី មុនសម្រេចចិត្ត ទៅប្រឡងក្នុងការចាប់យកវិជ្ជាជីវៈនាពេលអនាគត គោលបំណងទី២ ស្វែងយល់អំពីរបៀបនៃការដាក់ពាក្យ និងនីតិវិធីនៃការប្រឡងប្រជែងក្នុងវិស័យ ការងារទាំងរដ្ឋនិងឯកជន គោលបំណងទី៣ ជំរុញលើកទឹកចិត្តឱ្យនិស្សិតខិតខំសិក្សាពង្រឹងសមត្ថភាពផ្នែកច្បាប់ និងស្វែងរកការងារធ្វើនៅក្នុងវិស័យច្បាប់ គោលបំណងទី៤ ចូលរួមចែករំលែកផ្សព្វផ្សាយច្បាប់ និងគោលបំណងទី៥ ដើម្បីពង្រឹងកិច្ចសហការជាដៃគូក្នុងនាមក្រុមមគ្គទេសក៍ច្បាប់ ជាមួយ សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប។
        បន្ថែមពីនេះនៅក្នុងការធ្វើបទបង្ហាញរបស់វាគ្មិននីមួយៗបានផ្តោតលើចំនុចសំខាន់ៗ ដូចជា សញ្ញាណទូទៅនៃវិជ្ជាជីវៈ ចៅក្រម មេធាវី ក្រឡាបញ្ជី អាជ្ញាសាលា និងសារការី ការត្រៀមលក្ខណៈសម្បត្តិក្នុងការប្រឡងប្រជែង ការចែករំលែកអំពីបច្ចេកទេសសរសេរពេលប្រឡង ការប្រឡងផ្ទាល់ និងបែបបទនៃការដាក់ពាក្យចូលរួមប្រឡងប្រជែងផងដែរ។
        ក្នុងនាមជាអ្នកវិជ្ជាជីវៈទាំងប្រាំដែលបម្រើរក្នុងវិស័យយុត្តិធម៌បានលើកទឹកចិត្តដល់ប្អូនៗ  ជានិស្សិតទាំងអស់ ពិសេសនិស្សិតជំនាញនីតិសាស្ត្រ ត្រូវខិតខំយកចិត្តទុកដាក់រៀនសូត្រ បង្កើនចំណេះដឹង សិក្សាស្រាវជ្រាវច្បាប់ និងត្រូវស្វែងយល់អំពីការរីកចម្រើននៃសង្គមជាតិ។`,
      date: '២៥​ កុម្ភៈ ២០២៥',
      save: false,
      thumbnail: 'https://aeu.edu.kh/pages/IMG_7088_1740715934.JPG',
      images: [
        'https://aeu.edu.kh/pages/IMG_7084_1740715975.JPG',
        'https://aeu.edu.kh/pages/IMG_7085_1740715991.JPG',
        'https://aeu.edu.kh/pages/IMG_7083_1740716014.JPG',
        'https://aeu.edu.kh/pages/IMG_7094_1740716031.JPG',
        'https://aeu.edu.kh/pages/IMG_7086_1740716049.JPG',
      ],
    },
    {
      id: 5,
      title: `ប្រធានគណៈមេធាវីកម្ពុជា៖ តួនាទីរបស់មេធាវីកាន់តែមានសារៈសំខាន់ ពេលដែលសង្គមត្រូវបានធ្វើទំនើបកម្ម និងមានការវិវត្តន៍ឥតឈប់ឈរ`,
      category: 'event',
      date: '២២ កុម្ភៈ ២០២៥',
      content: `(ភ្នំពេញ)៖ លោកមេធាវី សាំង វណ្ណៈ ប្រធានគណៈមេធាវីនៃកម្ពុជា បានថ្លែងបញ្ជាក់ថា តួនាទីរបស់មេធាវី ដែលរួមមានការតំណាង ការការពារក្ដី ការប្រឹក្សាយោបល់ និងតាក់តែងលិខិតស្នាមគតិយុត្ត ក៏ដូចជា​ការធ្វើជា​​អាជ្ញាកណ្ដាល អ្នកផ្សះផ្សា ឬអ្នកសម្រុះសម្រួលជាអាទិ៍ កាន់តែមានសារៈសំខាន់ ខណៈពេលដែលសង្គមត្រូវបានធ្វើទំនើបកម្ម និងមានការវិវត្តន៍ឥតឈប់ឈរ ជាពិសេសនៅក្នុងបរិបទនៃសង្គមនីតិរដ្ឋ ដែលច្បាប់ និងលិខិតបទដ្ឋាន​​គតិយុត្តមានកាន់តែច្រើនឡើងៗពីមួយថ្ងៃទៅមួយថ្ងៃ ពីមួយឆ្នាំទៅមួយឆ្នាំ។
        លោកមេធាវី សាំង វណ្ណៈ បានលើកឡើងដូចនេះនាព្រឹកថ្ងៃទី២២ ខែមករា ឆ្នាំ២០២៥នេះ នាឱកាសអញ្ជើញធ្វើបាឋកថា ចែករំលែកចំណេះដឹងស្តីពី «វិជ្ជាជីវៈមេធាវី តួនាទីមេធាវីក្នុងវិស័យយុត្តិធម៌និងបែបបទនៃការ​ចូលប្រកប​វិជ្ជាជីវៈមេធាវី» ជូនដល់បុគ្គលិក សាស្ត្រាចារ្យ និងនិស្សិត សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប ដែលបានចូលរួមជិត ៤០០នាក់ និងដោយមានការចូលរួមជាសហគណៈអធិបតីគឺ អ្នកឧកញ៉ា លី ឃុនថៃ ប្រធានក្រុមប្រឹក្សាភិបាលសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប និងមានការចូលរួមពីលោក ស៊ុន សេដ្ឋា សាកលវិទ្យាធិការនៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប លោក លោកស្រីមេធាវី គណៈគ្រប់គ្រង បុគ្គលិក សាស្រ្តាចារ្យទាំងអស់នៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប និងមាននិស្សិត ជាច្រើននាក់ផងដែរ។
        លោកមេធាវី សាំង វណ្ណៈ បានបន្ថែមថា នៅពេលប្រជាពលរដ្ឋអាចមានការលំបាក ក្នុងការស្វែងយល់ឱ្យបានច្បាស់លាស់ និងគោរពឱ្យបានត្រឹមត្រូវ​តាមខ្លឹមសារនៃច្បាប់ និងបទប្បញ្ញត្តិជាធរមាន ហេតុនេះតួនាទី​របស់មេធាវី កាន់តែមានភាពចាំបាច់ដើម្បីធានាបាន​នូវសុវត្ថិភាពគតិយុត្តនៃសកម្មភាពអាជីវកម្ម និងសកម្មភាពរស់នៅប្រចាំថ្ងៃ​មួយចំនួនរបស់​ប្រជាពលរដ្ឋ​នៅក្នុងសង្គមតាមរយៈ ការផ្តល់សេវាប្រឹក្សាយោបល់ ការរៀបចំឯកសារផ្លូវច្បាប់នានាដែលច្បាប់អនុញ្ញាត និងដើម្បីការពារនូវ សិទ្ធិស្របច្បាប់ នៅក្នុងករណីដែលមានវិវាទកើតឡើង។
        បន្ថែមពីនេះក្នុងករណីដែលវិវាទត្រូវបានប្តឹង ផ្តល់ទៅដល់តុលាការ ជំនួយរបស់មេធាវីក្នុងការការពារក្តីជូនប្រជាពលរដ្ឋនៅក្នុងដំណើរការនីតិវិធី តុលាការ រឹងរឹតតែមានភាពចាំបាច់ និងមានសារៈសំខាន់ថែមទៀត ម៉្យាងដោយសារនីតិវិធីក្នុងប្រព័ន្ធ តុលាការមានច្រើនប្រភេទ ហើយមានលក្ខណៈបច្ចេកទេសស៊ីជម្រៅ និងម៉្យាងទៀត ដើម្បីជួយដល់ប្រជាពលរដ្ឋក្នុងការការពារសិទ្ធិ និងផលប្រយោជន៍ស្របច្បាប់របស់ខ្លួន នៅក្នុងកិច្ចដំណើរការនៃនីតិវិធី នានារបស់តុលាការ។
        ក្នុងនាមជាប្រធានស្ថាប័នបម្រើដល់ការអនុវត្តច្បាប់ និងយុត្តិធម៌សង្គម លោកប្រធានគណៈមេធាវី ក៏បានលើកទឹកចិត្ត ប្អូនៗជានិស្សិតទាំងអស់ ពិសេសនិស្សិតជំនាញនីតិសាស្ត្រ ត្រូវខិតខំយកចិត្តទុកដាក់រៀនសូត្រ បង្កើនចំណេះដឹង សិក្សាស្រាវជ្រាវច្បាប់ និងត្រូវស្វែងយល់អំពីរីកចម្រើននៃសង្គមជាតិ ត្រូវមានសុទិដ្ឋិនិយមចំពោះការដឹកនាំនៃស្ថាប័ននានារបស់ជាតិ ប្រព័ន្ធយុត្តិធម៌ ដំណើរការនៃការពង្រឹងនីតិរដ្ឋនៅកម្ពុជា ការអនុវត្តច្បាប់ និងលទ្ធិប្រជាធិបតេយ្យសេរីពហុបក្សនៅកម្ពុជា និង តថភាពជាក់ស្តែងនៃសង្គម នយោបាយ សេដ្ឋកិច្ច ព្រមទាំងស្ថានភាពនៃប្រជាជន។
        បន្ថែមពីនេះលោកប្រធានគណៈមេធាវី បានគូសបញ្ជាក់ថា គោលនយោបាយដឹកនាំទាំង ៩ចំណុច ដែលលោកប្រធានបានដាក់ចេញ ជាពិសេសពាក់ព័ន្ធនឹងការបណ្ដុះបណ្ដាល​ដល់អ្នកដែលមានឧបនិស្ស័យ​មានបំណងចូលប្រកបវិជ្ជាជីវៈមេធាវីគឺអាចដាក់ពាក្យចូលរួមប្រឡងប្រជែង នៅពេលមានសេចក្ដីជូនដំណឹង ហើយសូមមានជំនឿចិត្តថា « ចេះគឺជាប់ »។
        នាឱកាសនោះអ្នកឧកញ៉ា លី ឃុនថៃ បានឱ្យដឹងដែរថា ដើម្បីជួយពង្រឹងសមត្ថភាព និងលើកកម្ពស់ចំណេះដឹងថ្មីៗ, សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប បានរៀបចំនូវកម្មវិធីបាថកថា សិក្ខាសាលា និងវេទិការវិទ្យាសាស្ត្រ​ជាច្រើនដង និងជាប្រចាំឆ្នាំទៅតាមកម្មវិធីដែលបានគ្រោងទុក ក្នុងរង្វង់ប្រមាណពី១០-១៥ដង តាមរយៈជំនាញផ្សេងៗគ្នានៃមហាវិទ្យាល័យនីមួយៗ និងសាលាក្រោយឧត្តម ដោយបានអញ្ជើញបណ្ឌិតសភាចារ្យ សាស្ត្រាចារ្យ អ្នកឯកទេស វាគ្មិនល្បីៗកម្រិតគរុសភា(Academic) ដែលមានជំនាញជ្រៅជ្រះទាំងក្នុងវិស័យសាធារណៈ និងឯកជន។
        អ្នកឧកញ៉ា បានបន្ថែមថា ជាសក្ខីភាពសាកលវិទ្យាល័យបានប្រារព្ធនូវកម្មវិធីបាឋកថា ដែលបានទទួលវាគ្មិនជំនាញវិជ្ជាជីវៈដែលជាថ្នាក់ដឹកនាំនៃស្ថាប័នគណៈមេធាវី មកធ្វើបទបង្ហាញ ដើម្បីផ្តល់នូវចំណេះដឹង ពិសោធន៍ជាក់ស្តែងអំពី វិជ្ជាជីវៈមេធាវី តួនាទីមេធាវីក្នុងវិស័យយុត្តិធម៌ និងបែបបទនៃការចូលប្រកបវិជ្ជាជីវៈមេធាវី ដែលប្រធានបទនេះ គឺពិតជាមានសារៈសំខាន់ខ្លាំងណាស់សម្រាប់និស្សិត សាស្ត្រាចារ្យ និងបុគ្គលិក ជាពិសេសសម្រាប់អ្នកសិក្សា ជំនាញនីតិសាស្រ្ត នេះតែម្តង៕`,
      save: false,
      thumbnail: 'https://www.aeu.edu.kh/news/8Y9A9738.jpg_1736934837.jpg',
      images: [
        'https://www.aeu.edu.kh/pages/photo_2025-01-22_16-03-27_1737775987.jpg',
        'https://www.aeu.edu.kh/pages/photo_2025-01-22_16-03-25%20(2)_1737776006.jpg',
        'https://www.aeu.edu.kh/pages/photo_2025-01-22_16-03-25_1737776026.jpg',
        'https://www.aeu.edu.kh/pages/photo_2025-01-22_16-03-27%20(2)_1737776048.jpg',
        'https://www.aeu.edu.kh/pages/photo_2025-01-22_16-03-28_1737776069.jpg',
        'https://www.aeu.edu.kh/pages/photo_2025-01-22_16-03-26_1737776093.jpg',
      ],
    },
    {
      id: 6,
      title:
        'កិច្ចទទួលជួបពិភាក្សាការងាររវាងសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប ជាមួយ លោកបណ្ឌិត Megat Mohd Samsul Megat Ismail',
      category: 'event',
      date: '១៦ មករា ២០២៥',
      content: `រសៀលថ្ងៃព្រហស្បតិ៍ ៣រោច ខែបុស្ស ឆ្នាំរោង ឆស័ក ព.ស.២៥៦៨ ត្រូវនឹងថ្ងៃទី១៦ ខែមករា ឆ្នាំ២០២៥ នេះ លោក ស៊ុន សេដ្ឋា សាកលវិទ្យាធិការនៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប និងជាតំណាងដ៏ខ្ពង់ខ្ពស់អ្នកឧកញ៉ា លី ឃុនថៃ ប្រធានក្រុមប្រឹក្សាភិបាលនៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប រួមជាមួយគណៈគ្រប់គ្រង ទទួលជួបពិភាក្សាការងារជាមួយ  បណ្ឌិត Megat Mohd Samsul Megat Ismail អ្នកគ្រប់គ្រងជាន់ខ្ពស់ផ្នែកទំនាក់ទំនងទីផ្សារ ប្រចាំតំបន់អាស៊ីអាគ្នេយ៍ (អាស៊ាន) នៃស្ថាប័នអប់រំឧត្តមសិក្សាប្រទេសម៉ាឡេស៊ី នៅបន្ទប់ប្រជុំ អគារមាស ជាន់ទី១២ នៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប។`,
      save: false,
      thumbnail:
        'https://www.aeu.edu.kh/pages/photo_2025-01-16_18-34-50%20(2)_1737175828.jpg',
      images: [
        'https://www.aeu.edu.kh/pages/photo_2025-01-16_18-34-48_1737175848.jpg',
        'https://www.aeu.edu.kh/pages/photo_2025-01-16_18-34-48%20(2)_1737175866.jpg',
        'https://www.aeu.edu.kh/pages/photo_2025-01-16_18-34-50_1737175885.jpg',
        'https://www.aeu.edu.kh/pages/photo_2025-01-16_18-34-50_1737175885.jpg',
      ],
    },
    {
      id: 7,
      title: `រដ្ឋមន្ដ្រី នេត្រ ភក្ដ្រា ចាត់ទុកគ្រឹះស្ថានឯកជន ដើរតួនាទីសំខាន់ក្នុងការជួយបណ្ដុះបណ្ដាលធនធានមនុស្ស`,
      category: 'event',
      date: '២១ ធ្នូ 2024',
      content: `(ភ្នំពេញ)៖ លោក នេត្រ ភក្ត្រា រដ្ឋមន្ត្រីក្រសួងព័ត៌មាន បានចាត់ទុកថា សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប បានដើរតួនាទីយ៉ាងសំខាន់ក្នុងការបណ្តុះបណ្តាលធនធានមនុស្ស ហើយធនធានមនុស្សដែលបានឆ្លងកាត់នៅសាលានេះ បានបំពេញកិច្ចការងារចូលរួមចំណែកជាមួយរាជរដ្ឋាភិបាល លើការបម្រើជាតិ និងប្រជាជន ក៏ដូចជាការចូលរួមអភិវឌ្ឍសេដ្ឋកិច្ចជាតិ។
        ក្នុងឱកាសអញ្ជើញជាអធិបតីពិធីជួបជុំអតីតនិស្សិត និងពិសាភោជនាហារសាមគ្គីគ្រួសារសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប នៅល្ងាចថ្ងៃទី២១ ខែធ្នូ ឆ្នាំ២០២៤ លោក នេត្រ ភក្ដ្រា បានបញ្ជាក់ថា សាកលវិទ្យាល័យអាសុី អឺរ៉ុប ក៏បានផ្តល់នូវក្តីសង្ឃឹមដល់កូនចៅប្រជាពលរដ្ឋក្រីក្រនៅតាមជនបទ តាមរយៈការទទួលបាននូវអាហារូបករណ៍។
        លោករដ្ឋមន្ត្រី នេត្រ ភក្ត្រា ក្នុងនាមរាជរដ្ឋាភិបាល សូមថ្លែងនូវអំណរគុណចំពោះសាកលវិទ្យាអាសុី អឺរ៉ុប ដែលផ្តល់អាហារូបករណ៍ ដល់អ្នកមិនមានលទ្ធភាពបន្តការសិក្សា អោយមានលទ្ធភាពបន្តការសិក្សានៅសាកលវិទ្យាបាន។ ជាមួយគ្នានេះ សាកលវិទ្យាអាសុី អឺរ៉ុប ក៏ជាផ្នែកមួយចូលរួមកែប្រែអនាគតរបស់ប្រជាជនកម្ពុជាមួយចំនួន ជាពិសេសយុវជនដែលមិនមានលទ្ធភាពហើយទទួលបានអាហារូបករណ៍ពីសាកលវិទ្យាល័យនេះ បានធ្វើអោយនិស្សិតទាំង នោះមានការងារធ្វើ មានចំណូល ដែលធ្វើអោយអនាគតមានការរីកចម្រើន។
        លោករដ្ឋមន្ត្រី បានលើកឡើងថា រាជរដ្ឋាភិបាលកម្ពុជាអាណត្តិទី៧ ដឹកនាំដោយសម្តេចធិបតីនាយករដ្ឋមន្ត្រី ហ៊ុន ម៉ាណែត ដែលបន្តវេនពីសម្តេចតេជោ ហ៊ុន សែន គឺសម្តេចបានកំណត់ក្នុងយុទ្ធសាស្រ្តបញ្ចកោណដំណាក់កាលទី១ ដោយនៅក្នុងបញ្ចកោណទី១ បានផ្តោតសំខាន់ទៅលើការអភិវឌ្ឍមូលធនមនុស្សគឺជាលក្ខខណ្ឌចាំបាច់មិនអាចខ្វះបានសម្រាប់ជំរុញពិពិធកម្ម និងកំណើនសេដ្ឋកិច្ច ប្រកបដោយបរិយាបន្ន និងភាពធន់។ មូលធនមនុស្សមានគុណភាពខ្ពស់ និងសុខភាពល្អ គឺជាទ្រព្យសកម្មជាតិដ៏រឹងមាំ សម្រាប់បង្កើនតម្លៃសេដ្ឋកិច្ច លើកកម្ពស់តម្លៃវប្បធម៌ និងបង្កើតគំនិតថ្មីៗ សំដៅធានាចីរភាពកំណើនរយៈពេលវែង និងជវភាពនៃការអភិវឌ្ឍសង្គម-សេដ្ឋកិច្ច
        អ្នកឧកញ៉ា កិត្តិបណ្ឌិត លី ឃុនថៃ ប្រធានក្រុមប្រឹក្សាភិបាលសាកលវិទ្យាល័យអាសុីអឺរ៉ុប បានជម្រាបជូនថា ការជួបជុំគ្នានាឱកាសនេះ គឺជាជួបស្គាល់គ្នា រ៉ាប់អានគ្នាទៅវិញទៅមក ពិសេសរំលឹកអនុស្សាវរីយ៍ របស់អតីតនិស្សិតសាកលវិទ្យាល័យអាសុីអឺរ៉ុប គ្រប់ជំនាន់ទាំងអស់ដោយក្នុងនោះ លោក នេត្រ ភក្ត្រា រដ្ឋមន្ត្រីក្រសួងព័ត៌មាន ក៏ជាអតីតនិស្សិតដែលបានសិក្សានៅសាកលវិទ្យាអាសុីអឺរ៉ុបនេះដែរ។
        អ្នកឧកញ៉ា បានបញ្ជាក់ថា សាកលវិទ្យាល័យ អាសុីអឺរ៉ុប បានចូលរួមកសាង និងបណ្តុះបណ្តាលធនធានមនុស្ស ចាប់តាំងពីឆ្នាំ២០០២មកម្ល៉េះ ហើយរហូតមកដល់បច្ចុប្បន្ននេះសាកលវិទ្យាល័យបានផ្តល់ការបណ្តុះបណ្តាលកំរិតរយៈខ្លី រហូតដល់ថ្នាក់អនុបណ្ឌិត និងបណ្ឌិត៕`,
      save: false,
      thumbnail:
        'https://www.aeu.edu.kh/pages/471152208_1111923113706122_6959926773480706055_n_1736480507.jpg',
      images: [
        'https://www.aeu.edu.kh/pages/471147568_1111924830372617_2297452604905564407_n_1736480554.jpg',
        'https://www.aeu.edu.kh/pages/471257401_1111925157039251_7759449759748589275_n_1736480588.jpg',
        'https://www.aeu.edu.kh/pages/471257883_1111923670372733_7223409306922431177_n_1736480630.jpg',
      ],
    },
    {
      id: 8,
      title: `វគ្គបណ្ដុះបណ្ដាលស្ដីពី "ការជំរុញការយល់ដឹងក្នុងវិស័យមូលបត្រ"`,
      category: 'event',
      date: '21 ធ្នូ 2024',
      content: `មហាវិទ្យាល័យគ្រប់គ្រងពាណិជ្ជកម្ម និងទេសចរណ៍ និងមហាវិទ្យាល័យសង្គមសាស្រ្ដ និងសេដ្ឋកិច្ច បានសហការជាមួយសាលាក្រោយឧត្ដម នៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប ដឹកនាំនិស្សិតគ្រប់ជំនាញចូលរួមវគ្គបណ្ដុះបណ្ដាលស្ដីពី "ការជំរុញការយល់ដឹងក្នុងវិស័យមូលបត្រ"រៀបចំដោយក្រុមហ៊ុន អេស៊ីលីដា ស៊ីឃ្យួរីធី ភីអិលស៊ី និងនិយ័តករមូលបត្រកម្ពុជា នៅព្រឹកថ្ងៃទី២៨ ខែកក្កដា ឆ្នាំ២០២២ នៅសាលសន្និសីទអគារមាសជាន់ទី១៣ នៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប`,
      save: false,
      thumbnail:
        'https://expo2023.aeu.cloud/pages/photo_2022-07-28_15-40-19_1728450539.jpg',
      images: [
        'https://expo2023.aeu.cloud/pages/photo_2022-07-28_15-40-24_1728450553.jpg',
        'https://expo2023.aeu.cloud/pages/photo_2022-07-28_15-40-53_1728450566.jpg',
        'https://expo2023.aeu.cloud/pages/photo_2022-07-28_15-41-01_1728450577.jpg',
      ],
    },
    {
      id: 9,
      title: `ជំនួប​ពិភាក្សា​ជាមួយ​តំណាង​គ្រឹះស្ថាន​មីក្រូហិរញ្ញ​វត្ថុ មហានគរ ម.ក ជំនួបពិភាក្សាជាមួយតំណាងគ្រឹះស្ថានមីក្រូហិរញ្ញវត្ថុ មហានគរ ម.ក ក្នុងឱកាស ១)អបអរនឹងជូនពរឆ្នាំថ្មី ឆ្នាំសាកល២០២៣ ២)ពង្រឹងកិច្ចសហប្រតិបត្តិការរវាងសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប និងគ្រឹះស្ថានមីក្រូហិរញ្ញវត្ថុ មហានគរ ម.ក ដើម្បីអនុវត្តន៍នូវអនុសារណយោគយល់គ្នា(`,
      category: 'event',
      date: '21 ធ្នូ 2024',
      content: `នាព្រឹកថ្ងៃទី០៥ ខែមករា ឆ្នាំ២០២៣ គណៈគ្រប់គ្រងនៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប រួមមានឯកឧត្តមសាស្រ្ដាចារ្យបណ្ឌិត សួស សោភា សាកលវិទ្យាធិការរង ទទួលបន្ទុកថ្នាក់បរិញ្ញាបត្រ-រង លោក ហេង ប៉េង ព្រឹទ្ធបុរសរង មហាវិទ្យាល័យសង្គមសាស្រ្ត និងសេដ្ឋកិច្ច និងលោក យឹម រដ្ឋា ប្រធានការិយាល័យទំនាក់ទំនងអន្តរជាតិ និងមុខរបរ បានជំនួបពិភាក្សាជាមួយតំណាងគ្រឹះស្ថានមីក្រូហិរញ្ញវត្ថុ មហានគរ ម.ក ក្នុងឱកាស
        ១)អបអរនឹងជូនពរឆ្នាំថ្មី ឆ្នាំសាកល២០២៣
        ២)ពង្រឹងកិច្ចសហប្រតិបត្តិការរវាងសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប និងគ្រឹះស្ថានមីក្រូហិរញ្ញវត្ថុ មហានគរ ម.ក ដើម្បីអនុវត្តន៍នូវអនុសារណយោគយល់គ្នា(MOU) ឱ្យកាន់តែមានប្រសិទ្ធភាព តទៅទៀតនាពេលខាងមុខ`,
      save: false,
      thumbnail:
        'https://expo2023.aeu.cloud/pages/photo_2023-01-05_09-24-45_1728451768.jpg',
      images: [
        'http://expo2023.aeu.cloud/pages/photo_2023-01-05_09-21-52_1728451790.jpg',
        'https://expo2023.aeu.cloud/pages/photo_2023-01-05_09-04-12_1728451810.jpg',
        'https://expo2023.aeu.cloud/pages/photo_2023-01-05_08-43-21_1728451824.jpg',
        '',
      ],
    },
    {
      id: 10,
      title: `ទស្សនកិច្ចសិក្សានៅ​វិទ្យាស្ថា​នស្រាវជ្រាវបច្ចេកវិទ្យាឧស្សាហកម្មកោះតៃវ៉ាន់​`,
      category: 'event',
      date: '២៨​ វិច្ឆិកា ២០១៩',
      content: `បដិវត្តន៍ឧស្សាហកម្ម​ 4.0 ពិតជាមានសារ:សំខាន់ណាស់នាពេលបច្ចុប្បន្ន​ ដូចនេះ​នាថ្ងៃទីព្រហស្បតិ៍​ ២កេីត​ ខែមិគសិរ​ ឆ្នាំកុរ​ ឯកស័ក​ ព.ស. ២៥៦៣​ ត្រូវនឹងថ្ងៃទី២៨​ ខែវិច្ឆិកា​ គ.ស. ២០១៩​ លោកបណ្ឌិត ជា សុភាព​ សាកលវិទ្យាធិការ​ សាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប​ បានដឹកនាំប្រតិភូនិស្សិតថ្នាក់ក្រោយបរិញ្ញាបត្រចុះទស្សនកិច្ចសិក្សានៅ​វិទ្យាស្ថា​នស្រាវជ្រាវបច្ចេកវិទ្យាឧស្សាហកម្មលេីកោះតៃវ៉ាន់​ ដេីម្បីផ្សារភ្ចាប់រវាងទ្រឹស្តីនិងការអនុវត្តន៍​ផ្ទាល់ និងរបកគំឃេីញថ្មីនៃ​បច្ចេកវិទ្យា​ដែលប្រេីក្នុងឧស្សាហកម្ម​ 4.0 និងស្វែងយល់ពីបច្ចេកវិទ្យាចុងក្រោយដូចជាប្រព័ន្តការពារមហារីក​ ការចាក់ស្ទីមសែលក្នុងវិស័យវិជ្ជសាស្រ្ត​ ដេីម្បីអោយអ្នកជំងឺកាត់បន្ថយការប្រេីប្រាស់ថ្នាំពេទ្យ​ ឬបឈ្ឈប់/រាលដាលជំងឺ​, ប្រព័ន្ធចំរោះទឺកស្អាត, ឌ្រូនសម្រាប់យោធា​ និងពាណិជ្ចកម្ម​ ប្រព័ន្ធច្រោះជាតិពុលក្នុងបរិយាកាស​ និងគម្រូប្រព័ន្ធអេឡិចត្រនិកដ៏ទំនើបចុងក្រោយសម្រាប់ដៃគូសហគ្រាសខ្នាតធំ​, Smart home, Clean environment, បច្ចេកវិទ្យា​ LED, បច្ចេកវិទ្យាប្រេីប្រាស់​ C02 និងកាត់បន្ថយការប្រេីប្រាស់ទឹកច្រេីន, សរសេរកម្មវិធីសម្រាប់ទូរស័ព្ទដៃ​ ជាដេីម។ ល។`,
      save: false,
      thumbnail:
        'https://expo2023.aeu.cloud/pages/76946659_1424731991025075_1278457523153666048_n_1728452524.jpg',
      images: [
        'https://expo2023.aeu.cloud/pages/78821965_1424732037691737_4572834805124694016_n_1728452533.jpg',
        'https://expo2023.aeu.cloud/pages/78297133_1424731967691744_8183596459204018176_n_1728452556.jpg',
        'https://expo2023.aeu.cloud/pages/79197392_1424730481025226_8687759253919760384_n_1728452568.jpg',
      ],
    },
    {
      id: 11,
      title: `កិច្ចទទួលស្វាគមន៍គណៈប្រតិភូអញ្ជើញមកពីអង្គការវិទ្យាស្ថានតស៊ូមតិ និងគោលនយោបាយ (API) និងអង្គការម្លប់បៃតង`,
      category: 'event',
      date: '១៦ មករា ២០២៥',
      content: `ព្រឹកថ្ងៃព្រហស្បតិ៍ ៣រោច ខែបុស្ស ឆ្នាំរោង ឆស័ក ព.ស.២៥៦៨ ត្រូវនឹងថ្ងៃទី១៦ ខែមករា ឆ្នាំ២០២៥ លោក ស៊ុន សេដ្ឋា សាកលវិទ្យាធិការ បានដឹកនាំគណៈគ្រប់គ្រងនៃសាកលវិទ្យាល័យ អាស៊ី អឺរ៉ុប ទទួលស្វាគមន៍គណៈប្រតិភូអញ្ជើញមកពីអង្គការវិទ្យាស្ថានតស៊ូមតិ និងគោលនយោបាយ (API) និងអង្គការម្លប់បៃតង ដើម្បីជម្រាបជូនពី គម្រោង ការកសាងសាមគ្គីភាពអាស៊ានតែមួយ និងនិរន្តរភាពនៃភាពជាដៃគូរវាង យុវជន អង្គការសង្គមស៊ីវិល និងរដ្ឋសមាជិក(A-SASSY) និងណែនាំគោលបំណងកម្មវិធីអប់រំបរិស្ថាន(EEP) និងបង្ហាញពីគោលបំណងចង់បង្កើតកិច្ចសហប្រតិបត្តការរវាងគ្នានិងគ្នានាពេលអនាគត។`,
      save: false,
      thumbnail:
        'https://www.aeu.edu.kh/pages/photo_2025-01-16_14-27-56_1737168404.jpg',
      images: [
        'https://www.aeu.edu.kh/pages/photo_2025-01-16_14-27-54_1737168427.jpg',
        'https://www.aeu.edu.kh/pages/photo_2025-01-16_14-27-55_1737168570.jpg',
        'https://www.aeu.edu.kh/pages/photo_2025-01-16_14-27-56%20(2)_1737168771.jpg',
      ],
    },
  ];

  private savedNews: News[] = []; // Cached list of saved news items

  constructor(private localStorageService: LocalStorageService) {
    super();
    this.loadFavoriteNews(); // Load saved news on initialization
  }

  // Get all news items
  getList(): Observable<News[]> {
    return of(this.fakeData);
  }

  // Get a single news item by ID
  getOne(id: number): Observable<News | undefined> {
    const newsItem: News | undefined = this.fakeData.find(
      (item) => item.id === id
    );
    return of(newsItem);
  }

  // Toggle save status and update localStorage
  saveNews(id: number): Observable<boolean> {
    let savedIds: string[] =
      this.localStorageService.getArray(LocalStorageEnum.NewsId) || [];
    const newsItem = this.fakeData.find((item) => item.id === id);

    if (newsItem) {
      newsItem.save = !newsItem.save; // Toggle save status
      if (newsItem.save) {
        savedIds.push(id.toString()); // Convert number to string before storing
      } else {
        savedIds = savedIds.filter((storedId) => storedId !== id.toString()); // Remove saved ID
      }

      // Update local storage
      this.localStorageService.setArray(LocalStorageEnum.NewsId, savedIds);
      return of(newsItem.save);
    }

    return of(false);
  }

  // Load favorite news from localStorage
  private loadFavoriteNews(): void {
    const savedIds =
      this.localStorageService.getArray(LocalStorageEnum.NewsId) || [];

    this.savedNews = this.fakeData.filter((news) => savedIds.includes(news.id));
  }

  // Get favorite news from savedNews
  getFavoriteNews(): Observable<News[]> {
    let savedIds: string[] =
      this.localStorageService.getArray(LocalStorageEnum.NewsId) || [];

    // Convert stored ID strings to numbers
    const numericIds = savedIds.map((id) => Number(id));

    // Filter news by ID
    const favoriteNews = this.fakeData.filter((item) =>
      numericIds.includes(item.id)
    );
    return of(favoriteNews);
  }
}
